# Инициализируем переменные

#1)Прибавляем к времени 1 секунду
#2)Рассматриваем вариант конца времени(tmax=t?)
#3)Сгенерируем число от 1 до 4(для ребенка и взрослого)
#4)Обновляем координаты, обращая внимание на направление
#5)Рассматриваем варианты выхода субъекта за территорию(для ребенка и взрослого)
#6)Вычисляем расстояние между взрослым и ребенком
#7)Варианты видимости ребенка взрослого и наоборот

#1
i = 1
def p(i):
    return i + 1
print(i)

#2

#3
random.randint(1,4)
random.randint(1,4)

#4

#6

from math import *
def distance(x1, x2,):
    c = sqrt((x2-x1)**2
    print(c)
